#### Terraform Format and Style `failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan `failure`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
google_iam_workload_identity_pool.terraform-pool: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool]
data.google_iam_policy.auth: Reading...
data.google_service_account.terraform_sa: Reading...
data.google_iam_policy.mcp_auth: Reading...
data.google_iam_policy.auth: Read complete after 0s [id=2066618159]
google_project_service.enable_api["artifactregistry.googleapis.com"]: Refreshing state... [id=mh-api-389212/artifactregistry.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=mh-api-389212/iam.googleapis.com]
data.google_iam_policy.mcp_auth: Read complete after 0s [id=2066618159]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=mh-api-389212/iamcredentials.googleapis.com]
google_project_iam_member.cloud_run_trace_agent: Refreshing state... [id=mh-api-389212/roles/cloudtrace.agent/serviceAccount:auto-deploy@mh-api-389212.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.terraform-provider: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool/providers/terraform-provider]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/650836814988/locations/global/workloadIdentityPools/terraform-pool/attribute.repository/o-ga09/MH-API]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_cloud_run_service.stg-mh-api will be created
  + resource "google_cloud_run_service" "stg-mh-api" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "stg-mh-api"
      + project                    = "mh-api-389212"
      + status                     = (known after apply)

      + metadata (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 10
              + service_account_name  = "mh-api-389212@appspot.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-api:af2efc555d275fbef2ff5be371e51ceac24818f3"
                  + name  = (known after apply)

                  + env {
                      + name  = "DATABASE_URL"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "DATABASE_URL"
                            }
                        }
                    }
                  + env {
                      + name  = "ENV"
                      + value = "PROD"
                    }
                  + env {
                      + name  = "GIN_MODE"
                      + value = "release"
                    }
                  + env {
                      + name  = "LOG_LEVEL"
                      + value = "INFO"
                    }
                  + env {
                      + name  = "PROJECTID"
                      + value = "mh-api"
                    }
                  + env {
                      + name  = "SENTRY_DSN"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "SENTRY_DSN"
                            }
                        }
                    }
                  + env {
                      + name  = "SERVICE_NAME"
                      + value = "mh-api"
                    }

                  + ports {
                      + container_port = 8080
                      + name           = "http1"
                    }

                  + resources (known after apply)

                  + startup_probe {
                      + failure_threshold     = 1
                      + initial_delay_seconds = 0
                      + period_seconds        = 240
                      + timeout_seconds       = 240

                      + tcp_socket {
                          + port = 8080
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.stg-mh-mcp will be created
  + resource "google_cloud_run_service" "stg-mh-mcp" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "stg-mh-mcp"
      + project                    = "mh-api-389212"
      + status                     = (known after apply)

      + metadata (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 10
              + service_account_name  = "mh-api-389212@appspot.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-mcp:af2efc555d275fbef2ff5be371e51ceac24818f3"
                  + name  = (known after apply)

                  + env {
                      + name  = "DATABASE_URL"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "DATABASE_URL"
                            }
                        }
                    }
                  + env {
                      + name  = "ENV"
                      + value = "PROD"
                    }
                  + env {
                      + name  = "GIN_MODE"
                      + value = "release"
                    }
                  + env {
                      + name  = "LOG_LEVEL"
                      + value = "INFO"
                    }
                  + env {
                      + name  = "PROJECTID"
                      + value = "mh-api"
                    }
                  + env {
                      + name  = "SENTRY_DSN"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "SENTRY_DSN"
                            }
                        }
                    }
                  + env {
                      + name  = "SERVICE_NAME"
                      + value = "mh-mcp"
                    }

                  + ports {
                      + container_port = 8080
                      + name           = "http1"
                    }

                  + resources (known after apply)

                  + startup_probe {
                      + failure_threshold     = 1
                      + initial_delay_seconds = 0
                      + period_seconds        = 240
                      + timeout_seconds       = 240

                      + tcp_socket {
                          + port = 8080
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.auth will be created
  + resource "google_cloud_run_service_iam_policy" "auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                          + "serviceAccount:mh-api-389212@appspot.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "mh-api-389212"
      + service     = "stg-mh-api"
    }

  # google_cloud_run_service_iam_policy.mcp_auth will be created
  + resource "google_cloud_run_service_iam_policy" "mcp_auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                          + "serviceAccount:mh-api-389212@appspot.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "mh-api-389212"
      + service     = "stg-mh-mcp"
    }

  # google_project_iam_binding.cloud_run_invoker will be created
  + resource "google_project_iam_binding" "cloud_run_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:mh-api-389212@appspot.gserviceaccount.com",
        ]
      + project = "mh-api-389212"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_binding.cloudtrace_agent will be created
  + resource "google_project_iam_binding" "cloudtrace_agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@mh-api-389212.iam.gserviceaccount.com",
        ]
      + project = "mh-api-389212"
      + role    = "roles/cloudtrace.agent"
    }

  # google_project_iam_binding.service_account_user will be created
  + resource "google_project_iam_binding" "service_account_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:terraform@mh-api-389212.iam.gserviceaccount.com",
        ]
      + project = "mh-api-389212"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_service.enable_api["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "enable_api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "mh-api-389212"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.enable_api["cloudrun.googleapis.com"] will be created
  + resource "google_project_service" "enable_api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "mh-api-389212"
      + service                    = "cloudrun.googleapis.com"
    }

  # google_project_service.enable_api["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "enable_api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "mh-api-389212"
      + service                    = "serviceusage.googleapis.com"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

```
</details>
*Pusher: @o-ga09, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*